# 3. Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
# Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу
# скрипта, введя, например, команду “stop”. При этом скрипт завершается, сформированный список выводится на экран.
# Подсказка: для данного задания примем, что пользователь может вводить только числа и строки. При вводе пользователем
# очередного элемента необходимо реализовать проверку типа элемента и вносить его в список, только если введено число.
# Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
# При этом работа скрипта не должна завершаться.
class NumberCheck(Exception):
    def __init__(self, txt):
        self.txt = txt


number_list = []
while True:
    try:
        inp_number = input('Введите число ')
        if inp_number == 'stop':
            break
        elif inp_number.isalpha():
            raise NumberCheck('Не число')
    except NumberCheck as err:
        print(err)
    else:
        number_list.append(int(inp_number))
print(number_list)
